In [37]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
sns.set()
pd.set_option('display.max_columns', None)

#01 595. Big Countries

In [ ]:
import pandas as pd

def big_countries(world: pd.DataFrame) -> pd.DataFrame:
    return world[['name', 'population', 'area']][(world.population >= 25000000) | (world.area >= 3000000)]

#02 1757. Recyclable and Low Fat Products

In [ ]:
import pandas as pd

def find_products(products: pd.DataFrame) -> pd.DataFrame:
    return products.query("low_fats == 'Y' & recyclable == 'Y'").loc[:, 'product_id':'product_id']

#03 183. Customers Who Never Order

In [ ]:
import pandas as pd

def find_customers(customers: pd.DataFrame, orders: pd.DataFrame) -> pd.DataFrame:
    df = pd.merge(customers, orders, left_on='id', right_on='customerId', suffixes=['_c', '_o'], how='left')
    return df[df.id_o.isna()].loc[:, 'name':'name'].rename(columns={'name': 'Customers'})

#04 1148. Article Views I

In [ ]:
import pandas as pd

def article_views(views: pd.DataFrame) -> pd.DataFrame:
    return pd.DataFrame(np.sort(views.query("author_id == viewer_id").author_id.unique()), columns=['id'])

In [50]:
df = sns.load_dataset('taxis')
df.head()

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan

In [57]:
pd.DataFrame(np.sort(df.query("fare == total").fare.unique()), columns=['fare'])

    fare
0    5.0
1    7.0
2    8.0
3   10.0
4   11.0
5   12.0
6   20.0
7   25.0
8   28.0
9   35.0
10  55.0
11  72.0

In [25]:
customers = pd.DataFrame({'id': [1, 2, 3, 4], 'name': ['Joe', 'Henry', 'Sam', 'Max']})
customers

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [26]:
orders = pd.DataFrame({'id': [1, 2], 'customerId': [3, 1]})
orders

   id  customerId
0   1           3
1   2           1

In [48]:
df = pd.merge(customers, orders, left_on='id', right_on='customerId', suffixes=['_c', '_o'], how='left')
df = df[df.id_o.isna()].loc[:, 'name':'name'].rename(columns={'name': 'Customers'})
df

  Customers
1     Henry
3       Max